
## Terraform Plan of GCP
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
google_service_account.github_project_automation_prototype_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com]
google_secret_manager_secret.github_project_automation_prototype_gh_token: Refreshing state... [id=projects/igsr5-368506/secrets/github-project-automation-prototype-gh-token]
google_secret_manager_secret.igsr5-daily_slack_admin_user_id: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-admin-user-id]
google_service_account.attendance_request_scheduler_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-a-r-s@igsr5-368506.iam.gserviceaccount.com]
data.google_iam_policy.igsr5_daily_cloud_run: Reading...
google_secret_manager_secret.igsr5-daily_slack_webhook_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-webhook-url]
google_secret_manager_secret.igsr5_daily_slack_bot_token: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-bot-token]
google_cloud_run_service.attendance_request_bot: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/attendance-request-bot]
google_secret_manager_secret.igsr5-daily_slack_signing_secret: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-signing-secret]
google_service_account.igsr5_daily_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-i-d@igsr5-368506.iam.gserviceaccount.com]
data.google_iam_policy.igsr5_daily_cloud_run: Read complete after 0s [id=3818910945]
google_cloud_run_service.github_project_automation_prototype: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/github-project-automation-prototype]
data.google_iam_policy.github_project_automation_prototype_cloud_run: Reading...
google_secret_manager_secret.igsr5_daily_database_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--database-url]
data.google_iam_policy.github_project_automation_prototype_cloud_run: Read complete after 0s [id=3818910945]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_admin_user_id: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-admin-user-id]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_signing_secret: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-signing-secret]
google_cloud_run_service.igsr5_daily: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/igsr5-daily]
google_secret_manager_secret_iam_policy.github_project_automation_prototype_gh_token: Refreshing state... [id=projects/igsr5-368506/secrets/github-project-automation-prototype-gh-token]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_webhook_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-webhook-url]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_bot_token: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-bot-token]
data.google_iam_policy.github_project_automation_prototype_invoker: Reading...
data.google_iam_policy.github_project_automation_prototype_invoker: Read complete after 0s [id=2575965494]
data.google_iam_policy.igsr5_daily_invoker: Reading...
data.google_iam_policy.igsr5_daily_invoker: Read complete after 0s [id=1740922505]
data.google_iam_policy.attendance_request_scheduler_sa_invoker: Reading...
data.google_iam_policy.attendance_request_scheduler_sa_invoker: Read complete after 0s [id=2608228920]
google_secret_manager_secret_iam_policy.igsr5_daily_database_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--database-url]
google_cloud_run_service_iam_policy.attendance_request_scheduler_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/attendance-request-bot]
google_cloud_run_service_iam_policy.igsr5_daily_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/igsr5-daily]
google_cloud_scheduler_job.igsr5_daily: Refreshing state... [id=projects/igsr5-368506/locations/asia-northeast1/jobs/igsr5-daily]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.github_project_automation_prototype has changed
  ~ resource "google_cloud_run_service" "github_project_automation_prototype" {
        id                         = "locations/asia-northeast1/namespaces/igsr5-368506/services/github-project-automation-prototype"
        name                       = "github-project-automation-prototype"
      + status                     = [
          + {
              + conditions                   = [
                  + {
                      + message = "spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Secret projects/823570656707/secrets/github-project-automation-prototype-gh-token/versions/1 was not found"
                      + reason  = "SecretsAccessCheckFailed"
                      + status  = "False"
                      + type    = "Ready"
                    },
                  + {
                      + message = ""
                      + reason  = ""
                      + status  = "True"
                      + type    = "ConfigurationsReady"
                    },
                  + {
                      + message = "spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Secret projects/823570656707/secrets/github-project-automation-prototype-gh-token/versions/1 was not found"
                      + reason  = "SecretsAccessCheckFailed"
                      + status  = "False"
                      + type    = "RoutesReady"
                    },
                ]
              + latest_created_revision_name = "github-project-automation-prototype-00001-xnw"
              + latest_ready_revision_name   = ""
              + observed_generation          = 1
              + url                          = ""
            },
        ]
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.github_project_automation_prototype is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "github_project_automation_prototype" {
      ~ id                         = "locations/asia-northeast1/namespaces/igsr5-368506/services/github-project-automation-prototype" -> (known after apply)
        name                       = "github-project-automation-prototype"
      ~ project                    = "igsr5-368506" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Secret projects/823570656707/secrets/github-project-automation-prototype-gh-token/versions/1 was not found"
                      - reason  = "SecretsAccessCheckFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Secret projects/823570656707/secrets/github-project-automation-prototype-gh-token/versions/1 was not found"
                      - reason  = "SecretsAccessCheckFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "github-project-automation-prototype-00001-xnw"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      - metadata {
          - annotations      = {
              - "run.googleapis.com/ingress"       = "all"
              - "run.googleapis.com/operation-id"  = "a9af6b48-1c81-4156-9c5b-8e820f8076c5"
              - "serving.knative.dev/creator"      = "igsr5-terraform@igsr5-368506.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "igsr5-terraform@igsr5-368506.iam.gserviceaccount.com"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - namespace        = "igsr5-368506" -> null
          - resource_version = "AAYIeNfs/M0" -> null
          - self_link        = "/apis/serving.knative.dev/v1/namespaces/823570656707/services/github-project-automation-prototype" -> null
          - uid              = "e1c7e98c-72be-46ca-8b54-7e6110d81c53" -> null
        }

      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> null
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              ~ service_account_name  = "823570656707-compute@developer.gserviceaccount.com" -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                    # (1 unchanged attribute hidden)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                    # (1 unchanged block hidden)
                }
            }
        }

      - traffic {
          - latest_revision = true -> null
          - percent         = 100 -> null
        }
    }

  # google_cloud_run_service_iam_policy.github_project_automation_prototype_sa_policy will be created
  + resource "google_cloud_run_service_iam_policy" "github_project_automation_prototype_sa_policy" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                          + "serviceAccount:cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "github-project-automation-prototype"
    }

  # google_cloud_scheduler_job.github_project_automation_prototype will be created
  + resource "google_cloud_scheduler_job" "github_project_automation_prototype" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "github-project-automation-prototype"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "0/3 * * * *"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = "cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`*